# Итоговая проверочная работа.  
## Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры или задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.  

### Описание решения.  
* В данной работе первоначальный массив задается на старте выполнения алгоритма.  
* Метод **ChangeArray** используется для создания нового массива строк, соответствующего условию отбора. В качестве аргумента данный метод принимает первоначально массив строк **string [] array**. Далее задается второй массив строк **string [] changedArray**, длина которого изначально равна первоначальному массиву строк и вводится переменная - счетчик **counter**.  
Далее вводится цикл **for**. В данном цикле вводится переменная **i** равная 0 и увеличивающаяся на единицу при прохождении цикла, пока данная переменная не превыщает длину первоначального массива **array**. 
Внутри цикла задается условие, при котором длинна элемента первоначального массива **array[i]** должна быть меньше или равна 3 символам. При выполнении данного условия элементу массива **changedArray [counter]** присваивается значение элемента массива **array[i]**. При этом переменная **counter** увеличивается на единицу, дотех пор пока выполняется цикл **for**.  
После заверщения цикла данный метод возвращает массив строк **changedArray**. 
* Следующий метод **ShowArray** используется для вывода массива строк. В качестве аргумента данный метод принимает  массив строк **string [] array**. Далее вводится цикл **for** с переменной **i**. Данной переменной **i** присваивается значение 0 и, при каждом прохождении цикла, переменная увеличивается на единицу, пока выполняется условие, при котором переменная **i** меньше длины массива **array**.  
В результате прохождения цикла консоль выводит на экран массив строк при помощи комманды **Console.Write (array [i] + " ")**.  
* При вызове метода **ShowArray** в него сначала в качестве аргумента передается массив строк, заданный на старте выполнения алгоритма **string [] givenArray**.  
Далее создается массив строк **string [] newArray** и данный массив передается в метод **ChangeArray** с аргументом **givenArray**.  
На заверщающем этапе вызывается метод **ShowArray** с аргументом **newArray**, который выводит в консоль новый сформированный массив строк, соответствующий заданному условию.

### Блок-схема под названием **"Формирование нового массива строк"** описывает основную содержательную часть - метод **ChangeArray** и находится в папке FinalWork_1.  

### Решение поставленной задачи находится в папке FinalWork_1, файл Program.cs.



